Repository: mathis2426/EasySave
Catalog: View/Resources/Lang.*.resx
Languages: fr

# job_created
source: Job created successfully!
fr: Travail de sauvegarde créé avec succès !

# enter_job_number_delete
source: Enter the job number to delete:
fr: Entrez le numéro du travail à supprimer :

# enter_job_number_execute
source: Enter the job number to execute:
fr: Entrez le numéro du travail à exécuter :

# job_deleted
source: Job deleted successfully!
fr: Travail de sauvegarde supprimé avec succès !

# job_executed
source: Job executed successfully!
fr: Travail de sauvegarde exécuté avec succès !

# welcome
source: Welcome to the Backup Program!
fr: Bienvenue dans le programme de sauvegarde !

# description1
source: This program allows you to create and manage backup jobs.
fr: Ce programme vous permet de créer et gérer des travaux de sauvegarde.

# description2
source: You can create, delete, and execute backup jobs.
fr: Vous pouvez créer, supprimer et exécuter des travaux de sauvegarde.

# continue
source: Press any key to continue...
fr: Appuyez sur une touche pour continuer...

# press_return
source: Press any key to return to the main menu...
fr: Appuyez sur une touche pour revenir au menu principal...

source: Main Menu
fr: Menu Principal

# option1
source: 1. Create Backup Job
fr: 1. Créer un travail de sauvegarde

# option2
source: 2. Delete Backup Job
fr: 2. Supprimer un travail de sauvegarde

# option3
source: 3. Execute Backup Job
fr: 3. Exécuter un travail de sauvegarde

# option4
source: 4. Change Language
fr: 4. Changer la langue

# option5
source: 5. Exit
fr: 5. Quitter

# select_option
source: Please select an option:
fr: Veuillez sélectionner une option :

# invalid_option
source: Invalid option. Please try again.
fr: Option invalide. Veuillez réessayer.

# exiting
source: Exiting the program...
fr: Fermeture du programme...

# create_job
source: Create Backup Job
fr: Créer un travail de sauvegarde

# enter_name
source: Enter the name of the job:
fr: Entrez le nom du travail :

# enter_source
source: Enter the source path:
fr: Entrez le chemin source :

# enter_target
source: Enter the target path:
fr: Entrez le chemin de destination :

# select_type
source: Select the type of backup (1 for Full, 2 for Differential):
fr: Sélectionnez le type de sauvegarde (1 pour complète, 2 pour différentielle) :

# invalid_input
source: Invalid input. Please try again.
fr: Entrée invalide. Veuillez réessayer.

# list_jobs
source: List of Backup Jobs:
fr: Liste des travaux de sauvegarde :

# delete_job
source: Delete Backup Job
fr: Supprimer un travail de sauvegarde

# no_jobs
source: No jobs available to delete.
fr: Aucun travail disponible à supprimer.

# execute_job
source: Execute Backup Job
fr: Exécuter un travail de sauvegarde

source: Change Language
fr: Changer la langue

source: Job Name
fr: Nom du travail

# job_source
source: Source Path
fr: Chemin source

# job_target
source: Target Path
fr: Chemin de destination

# invalid_job
source: Invalid job number. Please try again.
fr: Numéro de travail invalide. Veuillez réessayer.
